# Pandas - Input & Output

In [13]:
import numpy as np
import pandas as pd
import requests

In [19]:
df = pd.read_csv('../../data/example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df.to_csv('../../data/new_example.csv', index=False)
pd.read_csv('../../data/new_example.csv')

In [ ]:
pd.read_excel('../../data/Excel_Sample.xlsx',sheet_name='Sheet1', index_col=0)

In [ ]:
df.to_excel('../../data/Excel_Sample.xlsx', sheet_name='NewSheet')

In [14]:
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)')

In [15]:
df[0]

,Country / Area,UN continental region[4],UN statistical subregion[4],Population (1 July 2022),Population (1 July 2023),Change
0,India,Asia,Southern Asia,1.417173e+09,1.428628e+09,+0.81%
1,China[a],Asia,Eastern Asia,1.425887e+09,1.425671e+09,−0.02%
2,United States,Americas,Northern America,3.382899e+08,3.399966e+08,+0.50%
3,Indonesia,Asia,South-eastern Asia,2.755013e+08,2.775341e+08,+0.74%
4,Pakistan,Asia,Southern Asia,2.358249e+08,2.404857e+08,+1.98%
...,...,...,...,...,...,...
234,Niue,Oceania,Polynesia,1.934000e+03,1.935000e+03,+0.05%
235,Tokelau (New Zealand),Oceania,Polynesia,1.871000e+03,1.893000e+03,+1.18%
236,Vatican City,Europe,Southern Europe,5.100000e+02,5.180000e+02,+1.57%
237,Pitcairn Islands (United Kingdom),Oceania,Polynesia,NaN,NaN,NaN
238,World,NaN,NaN,7.975105e+09,8.045311e+09,+0.88%

In [17]:
from sqlalchemy import create_engine

In [18]:
engine = create_engine('sqlite:///:memory:')

In [22]:
df.to_sql('../../data/MyTable.sql', engine)

4

In [25]:
sqldf = pd.read_sql('../../data/MyTable.sql', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15